Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Fixed a & b up:: not suppressing b if a & b:: is present but disabled by #HotIf.
ja: a & b:: が存在するが #HotIf によって無効化されている場合、a & b up::が bを抑制しないように修正しました。

source: Fixed a.b[c] := d to invoke the getter for a.b if there is no setter.
ja: a.b[c] := dでセッターがないとき、a.bのゲッターを呼び出すように修正しました。

source: Fixed a.base := a to throw an error.
ja: a.base := aがエラーをスローするように修正しました。

source: Fixed property_get -c 0 -d 0 to allow global variables, as already allowed by -d 1.
ja: property_get -c 0 -d 0が-d 1で既に許可されているようにグローバル変数を使用できるようにを修正しました。

source: Fixed property_get -n <exception>.message and similar.
ja: property_get -n <exception>.messageなどを修正しました。

source: Fixed s[x] => x and other single-line properties starting with "s".
ja: s[x] => xと「s」で始まる他の単一行のプロパティを修正。

source: Fixed x.y := unset causing crashes or undefined behaviour.
ja: x.y := unsetがクラッシュや未定義の動作を引き起こす問題を修正しました。

source: Fixed A_Clipboard silently exiting when GetClipboardData returns NULL.
ja: GetClipboardDataがNULLを返したときにA_Clipboardが警告なしに終了するのを修正しました。

source: Fixed AltTab-related load-time errors to be consistent with other errors.
ja: AltTab関連のロードタイムエラーを他のエラーと矛盾しないように修正しました。

source: Fixed Array.Prototype.RemoveAt to return the removed value when Length is "explicitly omitted" with unset or var?.
ja: Array.Prototype.RemoveAt がunsetまたはvar?でLengthが「明示的に省略」された場合に削除された値を返すように修正しました。

source: Fixed Button control not becoming default when clicked.
ja: ボタンコントロールをクリックするとデフォルトにならない問題を修正。

source: Fixed COM errors to not show "(null)" when no description is available.
ja: COMのエラーで、説明文がない場合に「(null)」が表示されないように修正しました。

source: Fixed Click to not return an integer.
ja: Click関数が整数を返す問題を修正しました。

source: Fixed Critical Error when loading large icons with no alpha channel.
ja: アルファチャンネルのない大きなアイコンを読み込む際のクリティカルエラーを修正しました。

source: Fixed DBGp property evaluation causing Try without Catch to fail (since v2.0.14).
ja: v2.0.14 以降、DBGpプロパティを評価するときにTry without Catchが失敗する問題を修正しました。

source: Fixed DBGp property_get failing to retrieve properties due to incorrect paging (since v2.0.14).
ja: v2.0.14以降、誤ったページングのために、DBGp property_getがプロパティを取得できない問題を修正しました。

source: Fixed DBGp property_get paging items incorrectly (again).
ja: DBGpのproperty_getのページング項目が（再び）間違っていたのを修正しました。

source: Fixed DateTime/MonthCal Range option not applying minimum value.
ja: DateTime/MonthCal Rangeオプションで最小値が適用されない問題を修正。

source: Fixed Default (Switch) to allow space before the colon.
ja: デフォルト(Switch)でコロンの前にスペースが入るように修正しました。

source: Fixed Download throwing OSError(0) when error should be non-zero.
ja: Download関数がOSErrorのエラーコードが0以外にもかかわらず、OSError(0)をスローするのを修正しました。

source: Fixed Download to attempt anonymous authentication if the server requests client authentication.
ja: サーバーがクライアント認証を要求したときに、匿名認証を試みるようにダウンロードを修正しました。

source: Fixed EnableUIAccess to verify the private key when selecting a certificate.
ja: 証明書の選択時にEnableUIAccessが秘密鍵を検証するように修正しました。

source: Fixed EnableUIAccess when running as SYSTEM.
ja: SYSTEMとして実行中のEnableUIAccessを修正しました。

source: Fixed ExitApp on load-time error/warning dialogs to use exit code 2.
ja: ロード時のエラー/警告ダイアログでExitApp関数が終了コード2を使用するように修正しました。

source: Fixed FileSelect to validate Options.
ja: FileSelect関数がオプションを検証するように修正。

source: Fixed FileSetAttribute crash when used in a File Reading Loop.
ja: FileSetAttribute をファイル読み込みループで使用するとクラッシュする問題を修正しました。

source: Fixed Func.IsOptional(1) returning 0 in some cases where it shouldn't.
ja: Func.IsOptional(1)が0を返すべきでない場合があるのを修正しました。

source: Fixed Gui GetPos/GetClientPos when Gui has an owner window or +DPIScale.
ja: Guiにオーナーウィンドウまたは+DPIScaleがある場合のGui GetPos/GetClientPosを修正しました。

source: Fixed Gui event handler functions to not drop the Gui parameter when the Gui is its own event sink.
ja: Guiイベントハンドラ関数で、Guiがそれ自身のイベントシンクである場合に、Guiパラメータをドロップしないように修正しました。

source: Fixed GuiControl.Move() to be relative to the GUI's client area even when the GUI is not its parent.
ja: GUIがその親でない場合でも、GuiControl.Move()がGUIのクライアント領域に対して相対的になるように修正しました。

source: Fixed InputHook to respect the +S option for Backspace when acting as undo.
ja: バックスペースがやり直しに割り当てられているときに+Sオプションを参照するようにInputHook関数を修正しました。

source: Fixed LV.Add/Insert/Modify crashing when passed the minimum number of parameters.
ja: ListViewコントロールのAdd/Insert/Modifyメソッドに最小数のパラメータが渡されたときにクラッシュする問題を修正しました。

source: Fixed Launch Config GUI to update the "Run as administrator" and "Run with UI access" options.
ja: Launch Config GUIを修正して「管理者として実行」および「UIアクセスで実行」オプションを更新しました。

source: Fixed Menu Add overwriting items which were appended by Menu Insert.
ja: メニュー追加で、メニュー挿入で追加された項目が上書きされるのを修正しました。

source: Fixed MonthCal W-n (number of month) width values to not be affected by DPI scaling.
ja: MonthCalコントロールの横に複数月を表示するW-nオプションがDPIスケーリングの影響を受けないように修正しました。

source: Fixed MouseClickDrag to allow X1 and Y1 to be omitted.
ja: X1とY1を省略できるようにMouseClickDrag関数を修正しました。

source: Fixed MouseGetPos to make Control blank and not throw if ClassNN cannot be determined.
ja: ClassNNが特定できないとき、コントロールをブランクにしてエラーをスローしないようにMouseGetPosを修正しました。

source: Fixed OLE clipboard content (e.g. error dialog text) being lost on exit.
ja: エラーダイアログのテキストなど、OLEクリップボードの内容が終了時に失われる問題を修正しました。

source: Fixed OwnProps erroneously skipping properties with optional parameters.
ja: OwnPropsが誤ってオプションのパラメータを持つプロパティをスキップしていた不具合を修正しました。

source: Fixed OwnProps to assign the property name safely in cases where a property deletes itself.
ja: プロパティがそれ自身を削除するときにプロパティの名前を安全に割り当てるようにOwnPropsを修正しました。

source: Fixed PixelSearch to unset X when pixel is not found.
ja: PixelSearchでピクセルが見つからなかった場合にXをセットしないように修正。

source: Fixed Send to leave any prior {modifier Down} in effect even if the key happens to be physically held down.
ja: キーが物理的に押されたままになったとしてもそれ以前の{modifier Down}<//c0> が有効なままになるようSendを修正しました。

source: Fixed SetFont to permit leading spaces in the Options parameter.
ja: SetFontを修正し、Optionsパラメータの先頭のスペースを許可するようにしました。

source: Fixed Short DllCall arg type and undefined behaviour for invalid types.
ja: Short DllCall の arg タイプと、無効なタイプに対する未定義の挙動を修正しました。

source: Fixed StrPut failing if Length/Buffer is specified and MultiByteToWideChar doesn't support the WC_NO_BEST_FIT_CHARS flag for the target codepage.
ja: Length/Buffer が指定されてMultiByteToWideChar がターゲットコードページのWC_NO_BEST_FIT_CHARSフラグをサポートしていないときにStrPut が失敗するように修正しました。

source: Fixed SysGetIPAddresses causing a Critical Error when the network subsystem is non-functional; e.g. in Windows safe mode.
ja: Windowsがセーフモードの場合など、ネットワークサブシステムが機能していないときに重大なエラーが発生するSysGetIPAddresses関数を修正しました。

source: Fixed ToolTips intermittently appearing at the wrong position.
ja: ToolTipが断続的に間違った位置に表示されるのを修正しました。

source: Fixed Try/Catch/Else/Finally not executing Finally if Else returns.
ja: Elseを返したときにFinallyを実行しないようにTry/Catch/Else/Finallyを修正しました。

source: Fixed TypeError thrown by x is y to say "Class" rather than "Object".
ja: x is yがスローするTypeErrorを「Object」ではなく「Class」と表示するように修正しました。

source: Fixed Until preventing subfolder recursion in file loops.
ja: ファイルループでのサブフォルダーの再帰を防止するようにUntil文を修正しました。

source: Fixed Up/Down key handling in the Launch Config GUI.
ja: Launch Config GUI上でのUp/Downキーの処理を修正しました。

source: Fixed WinTitle ignoring character 1 when "ahk_" is at character 2.
ja: WinTitleで「ahk_」が2文字目にある場合、1文字目を無視するように修正。

source: Fixed WinTitle to support criteria longer than 1023 characters.
ja: 1023文字を超える条件をサポートするようWinTitleを修正しました。

source: Fixed WinTitles with two different ahk_id values to yield no match.
ja: WinTitles関数が2つの異なるahk_idを持つウィンドウにマッチしないのを修正しました。

source: Fixed __Enum(unset) to permit a second variable for Array, Match and Gui.
ja: Array、Match、Guiで2つ目の変数を許可するように __Enum(unset)を修正ました。

source: Fixed a bug where a key-down event is correctly suppressed by a hotkey, but sending an additional key-down with SendLevel > 0 would prevent the subsequent key-up from being suppressed, even if the sent event is ignored due to #InputLevel.
ja: キーダウンイベントがホットキーによって正しく抑制されるが、SendLevel > 0で追加のキーダウンを送信すると、送信されたイベントが#InputLevelによって無視されても、それに続くキーアップが抑制されないというバグを修正した。

source: Fixed a bug with custom combos where a set of hotkeys like a & b::, a:: and a up:: would fail to suppress the release of a if a:: alone is disabled with #HotIf.
ja: カスタムコンボで、a & b::、a::、a up::のようなホットキーのセットが、#HotIfでa::だけが無効になっている場合、aのリリースを抑制できないバグを修正しました。

source: Fixed a bug with deleting a breakpoint on a static line containing =>.
ja: =>を含む静的行のブレークポイントを削除する際のバグを修正。

source: Fixed a memory leak caused by incorrect reference counting when an object is enumerated via COM. [PR# 325]
ja: オブジェクトがCOM経由で列挙されたときに、誤った参照カウントがメモリリークを引き起こす問題を修正しました。[PR# 325]

source: Fixed a memory leak occurring for each regex callout.
ja: regEx calloutのたびにメモリリークが起きるのを修正しました。

source: Fixed a memory leak occurring when an object with no own properties is cloned.
ja: プロパティを持たないオブジェクトが複製されたときに発生するメモリリークを修正しました。

source: Fixed absent version download prompt to not show the UAC shield if UAC is disabled.
ja: UACが無効になっている場合、UACシールドを表示しないよう、不在バージョンのダウンロードプロンプトを修正しました。

source: Fixed an error message to refer to #HotIf rather than #IfWin.
ja: #IfWinではなく#HotIfを参照するようにエラーメッセージを修正しました。

source: Fixed an issue where any attempt to reinstall the keyboard or mouse hook would fail if the OS had automatically uninstalled the hook.
ja: OSが自動的にフックをアンインストールした場合、キーボードまたはマウスフックを再インストールしようとすると失敗する問題を修正しました。

source: Fixed an issue with hotkeys not firing due to a race condition.
ja: 競合状態によりホットキーが起動しない問題を修正しました。

source: Fixed breakpoint on control flow statement being "hit" when a fat arrow function on the line below it returns.
ja: 制御フロー文のブレークポイントが、その下の行のファットアロー関数が値を返したときに「ヒット」するのを修正しました。

source: Fixed breakpoints to work in arrow functions under a control flow statement without a block.
ja: ブロックのない制御フローステートメント中のアロー関数でブレークポイント機能するよう修正しました。

source: Fixed corrupted results from property_get when a property returns a temporary object with a string, such as x.y.z where y => {z:"a"}.
ja: プロパティがx.y.z where y => {z:"a"}のような文字列を含むテンポラリオブジェクトを返すときに、property_getが返す結果の不具合を修正しました。

source: Fixed crashes when an asynchronous command is received during the processing of another command.
ja: コマンドの処理中に別の非同期コマンドを受信するとクラッシュしてしまう問題を修正しました。

source: Fixed crashing when a ComObject is passed to a for-loop with only the second variable specified.
ja: ComObjectが2番目の変数のみ指定されたforループに渡されるとクラッシュする問題を修正しました。

source: Fixed crashing when a named function hotkey is used after #HotIf.
ja: HotIfの後に名前付き関数のホットキーを使用するとクラッシュする問題を修正しました。

source: Fixed debugger to break at the line of the call when stepping out of a function.
ja: 関数からステップアウトするときに、呼出行でブレークするようにデバッガを修正しました。

source: Fixed debugger to not delete temporary breakpoints which are ignored while evaluating DBGp property_get or context_get.
ja: DBGp property_getまたはcontext_getの評価中に無視される一時的なブレークポイントをデバッガが削除しないように修正しました。

source: Fixed debugger to safely handle property deletion during enumeration.
ja: 列挙中のプロパティを安全に削除できるようにデバッガを修正しました。

source: Fixed detection of key::try { as an error.
ja: key::try {がエラーとして検出される問題を修正しました。

source: Fixed detection of invalid suffix on a hotkey, such as Hotkey "a pu".
ja: Hotkey "a pu"のような、無効な接尾辞の検出を修正しました。

source: Fixed duplicate Gui control name errors to correctly abort the thread.
ja: GUIコントロール名の重複エラーを修正し、スレッドを正しく中断するようにした。

source: Fixed duplicate OnMessage calls for some keyboard messages.
ja: 一部のキーボード・メッセージのOnMessage呼び出しが重複していたのを修正しました。

source: Fixed error messages referring to parameter #65535.
ja: パラメータ#65535を参照するエラーメッセージを修正しました。

source: Fixed errors thrown by a ComObject wrapper not being propagated correctly if it is called via an object/COM.
ja: ComObjectラッパーがオブジェクト/COM経由で呼び出された場合にスローされるエラーが正しく伝搬されない問題を修正しました。

source: Fixed exceptions not being deleted after they are suppressed via property_set.
ja: 例外がproperty_setによって抑制された後に削除されない問題を修正しました。

source: Fixed execution of if-else-if-else-if containing fat arrow functions.
ja: ファット・アロー関数を含むif-else-if-else-ifの動作を修正しました。

source: Fixed hotstring with escape sequence causing next line to be skipped.
ja: エスケープシーケンスが次の行をスキップするホットストリングを修正。

source: Fixed hotstrings to use the Last Found Window set by #HotIf.
ja: ホットストリングが#HotIfで設定されたLast Found Windowを使用するように修正しました。

source: Fixed inability of LWin::Alt to be used to activate some Alt key combos.
ja: LWin::Altを使用しても一部のAltキーの組み合わせを有効にできない問題を修正しました。

source: Fixed incorrect IEnumVARIANT return count.
ja: IEnumVARIANTが返す数が誤っているのを修正しました。

source: Fixed inter-referenced closures being deleted prematurely.
ja: 相互参照されたクロージャが早期に削除される問題を修正しました。

source: Fixed internal calls to __Enum to not call __Call.
ja: __Enumへの内部呼び出しが__Callを呼び出していたのを修正しました。

source: Fixed issues when &ref is used on different aliases of the same variable.
ja: &ref が同じ変数の異なるエイリアスで使用されている場合の問題を修正しました。

source: Fixed issues with #Requires interpretation.
ja: #Requiresディレクティブの解釈に関する問題を修正しました。

source: Fixed key-up erroneously being suppressed after key-repeat presses it down in some cases.
ja: キーのリピートが押された後にキーアップが誤って抑制される問題を修正しました。

source: Fixed load-time errors sent to stdout showing incorrect file/line number in some cases.
ja: stdoutに送信されるロードタイムエラーにファイル/行番号が正しく表示されないことがあった問題を修正しました。

source: Fixed locating WindowSpy.ahk in Current User (non-admin) installs.
ja: カレントユーザー（非管理者）でのインストールでWindowSpy.ahkの場所を修正しました。

source: Fixed modal dialog boxes suppressing InputHook events.
ja: モーダルダイアログボックスがInputHookイベントを抑制する問題を修正しました。

source: Fixed mouse AltTab hotkeys not suppressing execution of a prefix hotkey, such as 1:: for 1 & WheelDown::AltTab.
ja: マウスのAltTabホットキーが、1 & WheelDown::AltTabに1::を割り当てるようなプレフィックスホットキーの実行を抑制しないように修正されました。

source: Fixed new threads being unable to prevent a message check with Critical.
ja: 新規スレッドでCriticalによるメッセージチェックを防止できない問題を修正しました。

source: Fixed numeric literals ending with a dot to not cause line continuation.
ja: 数値リテラルがドットで終わるときに行が継続しないように修正しました。

source: Fixed omitted parameters to receive their default values rather than the "optional argument marker" when an AutoHotkey method is called via IDispatch (COM).
ja: AutoHotkeyメソッドがIDispatch（COM）を介して呼び出された場合、省略されたパラメータが「オプション引数マーカー」ではなく、デフォルト値を受け取るように修正しました。

source: Fixed optional parameter default expressions (other than simple literal values) preventing the use of assume-global/assume-static.
ja: 単純なリテラル値以外のオプションのパラメーターのデフォルト式がassume-global/assume-staticの使用を妨げる問題を修正しました。

source: Fixed parameter type errors to show the correct parameter number.
ja: パラメータタイプのエラーで、正しいパラメータ番号が表示されるように修正しました。

source: Fixed potential misbehaviour of InputHook.KeyOpt() with single chars.
ja: InputHook.KeyOpt()が単一の文字で誤動作する可能性があったのを修正しました。

source: Fixed remapping to utilize right-hand modifier already being down.
ja: 右手モディファイアーがすでにダウンしていることを利用するようにリマッピングを修正。

source: Fixed reserved words to be permitted as method names, as documented.
ja: ドキュメントにあるように、予約語をメソッド名として許可するように修正しました。

source: Fixed sending of {ASC nnnn}.
ja: {ASC nnnn}の送信を修正しました。

source: Fixed some ambiguity with COM calls, such as x.y acting as x.y().
ja: x.yがx.y()として振る舞ってしまうなどのCOM呼び出しの曖昧さを修正しました。

source: Fixed stack traces to exclude calls to __new for Error subclasses.
ja: スタックトレースがErrorサブクラスの__newへの呼び出しを除外するように修正しました。

source: Fixed stdout/stderr packets sent during the processing of another command to not corrupt the pending response.
ja: 保留中のレスポンスを別のコマンドの処理中に送信されるstdout/stderrパケットが損なわないように修正しました。

source: Fixed syntax detection misinterpreting multi-line auto-replace hotstrings.
ja: 複数行にわたって自動で置換するホットストリングを誤って解釈する構文チェックを修正しました。

source: Fixed the Add method (Gui) to support the ShortDate option for DateTime controls.
ja: DateTimeコントロールが短い日付形式を使えるようにAddメソッド（Gui）を修正しました。

source: Fixed the Hotkey GUI control to allow setting the symbols ^, ! and + as hotkeys.
ja: ホットキーGUIコントロールを修正し、記号 ^、!と+をホットキーとして設定できるようにしました。

source: Fixed the Hotkey control to include modifiers when its value is set to a symbol.
ja: ホットキーコントロールの値がシンボルに設定されている場合、修飾子が含まれるように修正しました。

source: Fixed the default installation directory for command-line use.
ja: コマンドライン用のデフォルトのインストールディレクトリを修正しました。

source: Fixed the error dialog to handle letter key shortcuts even when text is focused.
ja: テキストがフォーカスされているときでも文字キーのショートカットを処理するようにエラーダイアログを修正しました。

source: Fixed the increment/decrement operators to throw UnsetError if the var is unset, not TypeError.
ja: varが未設定のときにTypeErrorではなくUnsetErrorをスローするようにincrement/decrement演算子を修正しました。

source: Fixed unexpected Catch/Else/Finally/Until not being flagged as an error in some cases.
ja: Catch/Else/Finally/Untilが予期せずエラーとしてフラグされない場合があったのを修正しました。

source: Fixed version selection GUI raising an error if Enter is pressed without selecting a version.
ja: バージョン選択GUIで、バージョンを選択せずにEnterキーを押すとエラーが発生する問題を修正しました。

source: Flags
ja: フラグ

source: Flags affecting the behaviour of the wrapper object; see ComObjFlags for details.
ja: ラッパーオブジェクトの動作に影響を与えるフラグ。詳細はComObjFlagsを参照してください。

source: Flags specifying how the system arranged minimized windows.
ja: 最小化されたウィンドウをシステムがどのように配置するかを指定するフラグ。

source: Float - Syntax & Usage | AutoHotkey v2
ja: Float - 構文と使用法｜AutoHotkey v2

source: Float is actually a class, but can be called as a function.
ja: Floatは実際にはクラスですが、関数として呼び出すことができます。

source: Floating point numbers can optionally be written in scientific notation, with or without a decimal point (e.g. 1e4 or -2.1E-4).
ja: 浮動小数点数は、小数点の有無にかかわらず科学的記数法で書くことができます。（例：1e4や -2.1E-4）。

source: Floating-point
ja: 浮動小数点

source: Floating-point numbers are formatted with full precision (but discarding redundant trailing zeroes), which may in some cases reveal their inaccuracy.
ja: 浮動小数点数は、完全な精度でフォーマットされます（ただし、余分な末尾のゼロは削除されます）ので、場合によっては不正確であることがわかります。

source: Floating-point numbers are generated from a 53-bit random integer, instead of a 32-bit random integer, and should be greater than or equal to Min and lesser than Max (but floating-point rounding errors can theoretically produce equal to Max).
ja: 浮動小数点数は、32ビット乱数ではなく53ビット乱数から生成され、Min以上Max未満でなければなりません（ただし、浮動小数点数の丸め誤差により、理論上はMaxと等しくなる場合があります）。

source: Floating-point numbers can also be formatted by using the Round function.
ja: 浮動小数点数は、Round関数を使って整形することも可能です。

source: Floating-point numbers generally support 15 digits of precision.
ja: 浮動小数点数は、一般的に15桁の精度をサポートしています。

source: Fmenu.Add A_LoopFileName, (*) => "" ; Do nothing.
ja: Fmenu.Add A_LoopFileName, (*) => "" ; 何もしません。

source: Focus (formerly F) and LoseFocus (formerly f) are supported by more (but not all) control types.
ja: Focus（旧F）およびLoseFocus（旧f）は、より多くの（しかしすべてではない）コントロールタイプでサポートされています。

source: Focusing a button does not automatically make it the default button, as would normally happen if a button is focused by user input.
ja: ユーザー入力によってボタンがフォーカスされた場合のように、ボタンをフォーカスしても自動的にデフォルトボタンになるわけではありません。

source: Focusing an edit control does not automatically select its text.
ja: エディットコントロールをフォーカスしても、自動的にそのテキストが選択されるわけではありません。

source: Folder := RegExReplace(DirSelect(), "\\$") ; Removes the trailing backslash, if present.
ja: Folder := RegExReplace(DirSelect(), "\\$") ; もしあれば，末尾のバックスラッシュを削除します。

source: Folder := SubStr(Folder, 1, -1) ; Remove the trailing backslash.
ja: Folder := SubStr(Folder, 1, -1) ; 末尾のバックスラッシュを削除する。

source: Following control types are value-capable:
ja: 以下の制御タイプはバリューキャパブルです：

source: Font Name
ja: フォント名

source: Font is antialiased, or smoothed, if the font supports it and the size of the font is not too small or too large.
ja: フォントがアンチエイリアスをサポートしており、フォントのサイズが小さすぎたり大きすぎたりしない場合は、アンチエイリアス、またはスムージングが行われます。

source: Font is never antialiased, that is, font smoothing is not done.
ja: フォントのアンチエイリアスは行われません。つまり、フォントスムージングは行われません。

source: For "AStr", a temporary ANSI copy of the string is created and its address is passed instead.
ja: 「AStr」の場合、文字列の一時的なANSIコピーが作成され、そのアドレスが代わりに渡されます。

source: For 32-bit processes, the ProgramW6432 environment variable contains the path of the 64-bit Program Files directory.
ja: 32ビットプロセスでは、ProgramW6432環境変数に64ビットProgram Filesディレクトリのパスが格納される。

source: For 32-bit scripts, if an incoming parameter is intended to be a signed integer, any negative numbers can be revealed by following this example:
ja: 32ビットスクリプトの場合、入力されるパラメータが符号付き整数であることを意図している場合、この例に従って負の数を明らかにすることができます：

source: For DropDownList, ComboBox, ListBox and Tab, the text of the selected item/tab is stored instead of its position number if the control lacks the AltSubmit option, or if the ComboBox's text does not match a list item.
ja: DropDownList、ComboBox、ListBox、Tabについては、コントロールにAltSubmitオプションがない場合、またはComboBoxのテキストがリストアイテムと一致しない場合、その位置番号ではなく、選択アイテム/Tabのテキストが格納されます。

source: For Slider controls, Info is a numeric value indicating how the slider moved.
ja: スライダーコントロールの場合、Infoはスライダーの動き方を示す数値です。

source: For compiled scripts based on a .bin file, the value is determined by reading the installation directory from the registry and appending "\AutoHotkey.exe".
ja: .binファイルに基づいてコンパイルされたスクリプトの場合は、レジストリからインストールディレクトリを読み取り、「\AutoHotkey.exe」を追加して値を決定します。

source: For control flow statements which require a body (and therefore support OTB), the brace can be the start of an object literal only if it is preceded by an operator, such as := { or for x in {.
ja: ボディを必要とする（したがってOTBをサポートする）制御フロー文の場合、中括弧は、:= {や for x in {のような演算子が先行する場合に限り、オブジェクト・リテラルの開始とすることができる。

source: For primitive values, the return value is the pre-defined prototype object corresponding to Type(Value).
ja: 原始的な値の場合は、Type(Value)に対応する定義済みのプロトタイプオブジェクトが返り値として返されます。

source: For SendPlay mode, the default Delay is -1.
ja: SendPlayモードでは、デフォルトのDelayは-1です。

source: For named subpatterns, enclose the name in braces; e.g. ${SubpatternName}.
ja: 名前付きサブパターンの場合は、名前を中括弧で囲みます（例：${SubpatternName}）。

source: For DropDownLists, ComboBoxes, and ListBoxes, it is the number of items visible at one time inside the list portion of the control (but it is often desirable to omit both the R and H options for DropDownList and ComboBox, as the popup list will automatically take advantage of the available height of the user's desktop).
ja: DropDownList、ComboBox、ListBoxの場合、コントロールのリスト部分で一度に表示できる項目の数です（ただし、DropDownListとComboBoxでは、ポップアップリストが自動的にユーザーのデスクトップの利用可能な高さを利用するため、Rと Hオプションの両方を省略することが望ましい場合があります）。

source: For Ptr*, the parameter's new value is assigned back to the object's Ptr property.
ja: Ptr*の場合、パラメータの新しい値は、オブジェクトのPtrプロパティに再び割り当てられます。

source: For catch, it is executed if no exception is thrown within try (and is not executed if any error or value is thrown, even if there is no catch matching the value's class).
ja: For catch、try内で例外が発生しなかった場合に実行されます（エラーや値が発生した場合は、値のクラスに合致するcatchがなくても実行されません）。

source: For SubFunction, specify one of the following:
ja: SubFunctionには以下のいずれかを指定する：

source: For Type, see the DllCall types table.
ja: タイプについては、DllCallタイプ表をご覧ください。

source: For Type, see the types table below.
ja: タイプについては、以下のタイプ表をご覧ください。

source: For WinTitle, each component is separate, e.g. in "i)^untitled ahk_class i)^notepad$ ahk_pid " mypid, i)^untitled and i)^notepad$ are separate regex patterns and mypid is always compared numerically (it is not a regex pattern).
ja: WinTitleの場合、各コンポーネントは別々で、例えば"i)^untitled ahk_class i)^notepad$ ahk_pid " mypidでは、i)^untitledとi)^notepad$は別々の正規表現パターンであり、mypidは常に数値で比較される（正規表現パターンではない）。

source: For WinText, each text element (i.e. each control's text) is matched against the RegEx separately, so it is not possible to have a match span more than one text element.
ja: WinTextの場合、各テキスト要素（つまり各コントロールのテキスト）は別々にRegExと照合されるため、複数のテキスト要素にまたがる照合はできません。

source: For Arg, specify the value to be passed to the function.
ja: Argの場合、関数に渡す値を指定します。

source: For Arg, specify the value to be passed to the method.
ja: 引数の場合、メソッドに渡す値を指定します。

source: For Catch, it is executed if no exception is thrown within Try (and is not executed if any error or value is thrown, even if there is no Catch matching the value's class).
ja: For Catch、Try内で例外が発生しなかった場合に実行されます（エラーや値が発生した場合は、値のクラスに合致するCatchがなくても実行されません）。

source: For Set, the second parameter is value (the value being assigned).
ja: Setの場合、第2パラメータはvalue（割り当てられる値）です。
